Revit 2027 API
LinkElementId(ElementId) Constructor
 Creates a new LinkElementId representing an element in the host document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId(
	ElementId elementId
)
Public Sub New (
	elementId As ElementId
)
public:
LinkElementId(
	ElementId^ elementId
)
new :
        elementId : ElementId -> LinkElementId
Parameters
elementId ElementId
 The id of the element in the host document.
See Also
Reference
LinkElementId Class
LinkElementId Overload
Autodesk.Revit.DB Namespace